socialNetwork/results/scaling-on-bench1.5-may19/benchmark1.5b-sweep-05-19-26_193117/st5-AttUpd/2800.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 152.743ms, rate sampling interval: 729ms
  Thread calibration: mean lat.: 125.875ms, rate sampling interval: 519ms
  Thread calibration: mean lat.: 168.602ms, rate sampling interval: 822ms
  Thread calibration: mean lat.: 132.500ms, rate sampling interval: 602ms
  Thread calibration: mean lat.: 179.602ms, rate sampling interval: 907ms
  Thread calibration: mean lat.: 228.581ms, rate sampling interval: 1099ms
  Thread calibration: mean lat.: 183.537ms, rate sampling interval: 1054ms
  Thread calibration: mean lat.: 146.795ms, rate sampling interval: 630ms
  Thread calibration: mean lat.: 197.203ms, rate sampling interval: 1044ms
  Thread calibration: mean lat.: 153.143ms, rate sampling interval: 723ms
  Thread calibration: mean lat.: 128.960ms, rate sampling interval: 568ms
  Thread calibration: mean lat.: 158.729ms, rate sampling interval: 734ms
  Thread calibration: mean lat.: 194.427ms, rate sampling interval: 914ms
  Thread calibration: mean lat.: 196.987ms, rate sampling interval: 934ms
  Thread calibration: mean lat.: 151.122ms, rate sampling interval: 607ms
  Thread calibration: mean lat.: 139.997ms, rate sampling interval: 661ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.72s     3.90s   15.67s    65.20%
    Req/Sec   156.93     20.36   189.00     91.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.14s 
 75.000%    8.45s 
 90.000%   11.13s 
 99.000%   15.67s 
 99.900%   19.81s 
 99.990%   23.28s 
 99.999%   23.41s 
100.000%   23.48s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.951     0.000000            1         1.00
     833.535     0.100000        27689         1.11
    2115.583     0.200000        55362         1.25
    3100.671     0.300000        83064         1.43
    4038.655     0.400000       110753         1.67
    5136.383     0.500000       138468         2.00
    5697.535     0.550000       152265         2.22
    6307.839     0.600000       166151         2.50
    6991.871     0.650000       179939         2.86
    7720.959     0.700000       193766         3.33
    8445.951     0.750000       207637         4.00
    8806.399     0.775000       214593         4.44
    9175.039     0.800000       221450         5.00
    9576.447     0.825000       228411         5.71
   10035.199     0.850000       235418         6.67
   10551.295     0.875000       242276         8.00
   10829.823     0.887500       245737         8.89
   11132.927     0.900000       249177        10.00
   11468.799     0.912500       252656        11.43
   11886.591     0.925000       256067        13.33
   12345.343     0.937500       259503        16.00
   12582.911     0.943750       261275        17.78
   12853.247     0.950000       263019        20.00
   13148.159     0.956250       264693        22.86
   13492.223     0.962500       266422        26.67
   13934.591     0.968750       268180        32.00
   14123.007     0.971875       269037        35.56
   14303.231     0.975000       269920        40.00
   14450.687     0.978125       270760        45.71
   14639.103     0.981250       271620        53.33
   14876.671     0.984375       272497        64.00
   15056.895     0.985938       272926        71.11
   15237.119     0.987500       273340        80.00
   15499.263     0.989062       273777        91.43
   15761.407     0.990625       274223       106.67
   16056.319     0.992188       274640       128.00
   16293.887     0.992969       274855       142.22
   16506.879     0.993750       275073       160.00
   16687.103     0.994531       275296       182.86
   16842.751     0.995313       275505       213.33
   17055.743     0.996094       275722       256.00
   17203.199     0.996484       275830       284.44
   17432.575     0.996875       275936       320.00
   17661.951     0.997266       276047       365.71
   18071.551     0.997656       276157       426.67
   18726.911     0.998047       276264       512.00
   19038.207     0.998242       276314       568.89
   19398.655     0.998437       276369       640.00
   19595.263     0.998633       276426       731.43
   19709.951     0.998828       276480       853.33
   19824.639     0.999023       276533      1024.00
   19922.943     0.999121       276558      1137.78
   20054.015     0.999219       276586      1280.00
   20152.319     0.999316       276611      1462.86
   20365.311     0.999414       276639      1706.67
   20791.295     0.999512       276665      2048.00
   20938.751     0.999561       276681      2275.56
   21037.055     0.999609       276692      2560.00
   21217.279     0.999658       276706      2925.71
   23019.519     0.999707       276719      3413.33
   23134.207     0.999756       276733      4096.00
   23150.591     0.999780       276740      4551.11
   23183.359     0.999805       276749      5120.00
   23199.743     0.999829       276755      5851.43
   23232.511     0.999854       276763      6826.67
   23265.279     0.999878       276767      8192.00
   23281.663     0.999890       276774      9102.22
   23281.663     0.999902       276774     10240.00
   23298.047     0.999915       276778     11702.86
   23314.431     0.999927       276782     13653.33
   23330.815     0.999939       276786     16384.00
   23330.815     0.999945       276786     18204.44
   23347.199     0.999951       276787     20480.00
   23363.583     0.999957       276791     23405.71
   23363.583     0.999963       276791     27306.67
   23379.967     0.999969       276792     32768.00
   23396.351     0.999973       276796     36408.89
   23396.351     0.999976       276796     40960.00
   23396.351     0.999979       276796     46811.43
   23396.351     0.999982       276796     54613.33
   23396.351     0.999985       276796     65536.00
   23412.735     0.999986       276799     72817.78
   23412.735     0.999988       276799     81920.00
   23412.735     0.999989       276799     93622.86
   23412.735     0.999991       276799    109226.67
   23412.735     0.999992       276799    131072.00
   23412.735     0.999993       276799    145635.56
   23412.735     0.999994       276799    163840.00
   23412.735     0.999995       276799    187245.71
   23412.735     0.999995       276799    218453.33
   23412.735     0.999996       276799    262144.00
   23478.271     0.999997       276800    291271.11
   23478.271     1.000000       276800          inf
#[Mean    =     5715.235, StdDeviation   =     3898.876]
#[Max     =    23461.888, Total count    =       276800]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  303511 requests in 2.00m, 4.21GB read
  Non-2xx or 3xx responses: 2
Requests/sec:   2530.19  
Transfer/sec:     35.96MB